src/Documents/НачислениеЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>НачислениеЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетЗатрат</xr:Item>
				<xr:Item>CalculationRegister.Начисления</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательРасчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/НачислениеЗарплаты/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Устарела. Не используется в текущей реализации
// Параметры:
//  документСсылка - ДокументСсылка.НачислениеЗарплаты
//  менеджер - МенеджерВременныхТаблиц, Неопределено - Если задан `МенеджерВременныхТаблиц` результата
//      будет помещен в `ВТ_НачислениеЗарплатыНачисления`
// Возвращаемое значение:
//  - ТаблицаЗначений - Если `МенеджерВременныхТаблиц` = Неопределено
//  - МенеджерВременныхТаблиц - Результат в `ВТ_НачислениеЗарплатыНачисления`
Функция ПолучитьНачисленияДокумента(Знач документСсылка, менеджер = Неопределено) Экспорт
    запрос = Новый Запрос;
    запрос.МенеджерВременныхТаблиц = ?(менеджер = Неопределено, Новый МенеджерВременныхТаблиц, менеджер);
    запрос.Текст =
        "ВЫБРАТЬ
        |   НачислениеЗарплатыНачисления.Сотрудник КАК Сотрудник,
        |   НачислениеЗарплатыНачисления.ГрафикРаботы КАК ГрафикРаботы,
        |   НачислениеЗарплатыНачисления.ВидРасчета КАК ВидРасчета,
        |   НачислениеЗарплатыНачисления.ДатаНачала КАК ДатаНачала,
        |   НачислениеЗарплатыНачисления.ДатаОкончания КАК ДатаОкончания,
        |   НачислениеЗарплатыНачисления.ПоказательРасчета КАК ПоказательРасчета
        |ПОМЕСТИТЬ ВТ_НачислениеЗарплатыНачисления
        |ИЗ
        |   Документ.НачислениеЗарплаты.Начисления КАК НачислениеЗарплатыНачисления
        |ГДЕ
        |   НачислениеЗарплатыНачисления.Ссылка = &Ссылка
        |";

    запрос.УстановитьПараметр("Ссылка", документСсылка);

    результатЗапроса = запрос.Выполнить();

    Если менеджер <> Неопределено Тогда // Если нужно только создать временную таблицу
        Возврат запрос.МенеджерВременныхТаблиц;
    Иначе
        запрос.Текст = СтрЗаменитьПоРегулярномуВыражению(запрос.Текст, "(?m)^ПОМЕСТИТЬ ВТ_НачислениеЗарплатыНачисления", "");
    КонецЕсли;

    Возврат результатЗапроса.выгрузить();
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
